cases/flowThrough/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    // #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        //type            fixedFluxPressure;
        //value           $internalField;
        type              zeroGradient;
    }

    outlet
    {
        //type            fixedValue;
        //value           $internalField;
        type            totalPressure;
        p0              $internalField;
    }

    top
    {
        type            fixedFluxPressure;
    }

    bottom
    {
        type            fixedFluxPressure;
    }

    front
    {
        type            fixedFluxPressure;
    }

    back
    {
        type            fixedFluxPressure;
    }

}

// ************************************************************************* //
